src/DataProcessors/АБ_РазовПрименПеренос_ПроставитьПризнакиУчитываемостиВСреднемЗаработке_У_Премий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АБ_РазовПрименПеренос_ПроставитьПризнакиУчитываемостиВСреднемЗаработке_У_Премий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/УчетНачисленийВСреднемЗаработкеОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>УчетНачисленийВСреднемЗаработкеОбщий</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийЗаработок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияФиксированнойСуммой</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияПроцентом</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяФиксированнойСуммой</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяПроцентом</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/АБ_РазовПрименПеренос_ПроставитьПризнакиУчитываемостиВСреднемЗаработке_У_Премий/Forms/Форма/Module.bsl
#Область АБ_Доработка4
&НаСервере
Процедура АБ_УчетПремииНаСервере()
Запрос=Новый Запрос;
Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
             |	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Регистратор КАК Регистратор
             |ИЗ
             |	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий";
Результат=Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
	НаборЗаписей=РегистрыНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Результат.Регистратор);
	НаборЗаписей.Прочитать();
	ТабПром=НаборЗаписей.Выгрузить();
	Для Каждого СтрокаОбработки Из ТабПром Цикл
		Если ЗначениеЗаполнено(СтрокаОбработки.Год) И (СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой ИЛИ  СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом ИЛИ  СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой ИЛИ СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом) Тогда
			СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом;
			СтрокаОбработки.Индексируется=Ложь;
		ИначеЕсли СтрокаОбработки.КоличествоМесяцев=3 И (СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой ИЛИ  СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом ИЛИ  СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой ИЛИ СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом) Тогда
			СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом;
			СтрокаОбработки.Индексируется=Ложь;
		ИначеЕсли СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой ИЛИ  СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом ИЛИ СтрокаОбработки.СоставнаяЧасть= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой ИЛИ СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом Тогда
			СтрокаОбработки.СоставнаяЧасть=Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой;
			СтрокаОбработки.Индексируется=Ложь;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Загрузить(ТабПром);
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка=Истина;
		НаборЗаписей.Записать();
	Исключение
		Сообщить(СтрокаОбработки.Регистратор);
	КонецПопытки;
	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура АБ_УчетПремии(Команда)
	АБ_УчетПремииНаСервере();
КонецПроцедуры
#КонецОбласти
